# 合并数据集

# 1数据库风格的DataFrame合并

In [2]:
from pandas import DataFrame,Series

In [3]:
import pandas as pd

In [4]:
#%pylab inline
#Populating the interactive namespace from numpy and matplotlib

In [5]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],
                'data1':range(7)})

In [6]:
df2 = DataFrame({'key':['a', 'b','d'], 'data2':range(3)})

In [7]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [8]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [9]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [10]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
# 如果两个对象的列名不同，也可以分别进行指定

In [11]:
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],
                'data1':range(7)})

In [12]:
df4 = DataFrame({'rkey':['a','b','d'],
                         'data2':range(3)})

In [13]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [14]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [15]:
pd.merge(df3, df4, left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [16]:
#默认情况下，merge做的是“inner”连接，结果中的键是交集。外连接取的是键的bingji：

In [17]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [18]:
# 多对多的合并操作

In [19]:
df1 = DataFrame({'key':['b','b','a','c','a','b'],
                'data1': range(6)})

In [20]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [21]:
df2 = DataFrame({'key':['a', 'b', 'a','b','d'],
                'data2': range(5)})

In [22]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [23]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [26]:
pd.merge(df1, df2, how='inner').sort_values('key')

  key  data1  data2
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3

In [27]:
#要根据多个键进行合并，传入一个由列名组成的列表即可

In [28]:
left = DataFrame({'key1':['foo','foo','bar'],
                 'key2': ['one','two','one'],
                 'lval':[1, 2, 3]})

In [29]:
right = DataFrame({'key1':['foo','foo','bar','bar'],
                  'key2':['one','one','one','two'],
                  'rval':[4,5,6,7]})

In [30]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [31]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [32]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [33]:
#在进行列-列连接时，DataFrame对象中的索引会被丢弃¶

In [34]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [35]:

pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

# 索引上的合并

In [36]:
#有时候连接键位于索引中，此时可以传入lefty_index=True或right_index=True（或两个都传）以说明索引应该被用作连接键：

In [37]:
left1 = DataFrame({'key':['a','b','a','a','b','c'],
                  'value':range(6)})

In [38]:
right1 = DataFrame({'group_val':[3.5, 7]}, index={'a', 'b'})

In [39]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [40]:
right1

   group_val
a        3.5
b        7.0

In [41]:

pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [42]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [44]:
import numpy as np
lefth = DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                  'key2':[2000, 2001, 2002, 2001, 2002],
                  'data': np.arange(5.)})

In [45]:
righth = DataFrame(np.arange(12).reshape((6,2)), index=[['Nebada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                                                       [2001,2000,2000,2000,2001,2002]],
                                                       columns = ['event1','event2'])

In [47]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [48]:
righth

             event1  event2
Nebada 2001       0       1
Nevada 2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [49]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True)

   key1  key2  data  event1  event2
0  Ohio  2000   0.0       4       5
0  Ohio  2000   0.0       6       7
1  Ohio  2001   1.0       8       9
2  Ohio  2002   2.0      10      11

In [50]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
        right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     NaN     NaN
4  Nevada  2002   4.0     NaN     NaN
4  Nebada  2001   NaN     0.0     1.0
4  Nevada  2000   NaN     2.0     3.0

In [51]:
#同时使用合并双方的索引也没问题

In [52]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a','c','e'],
                 columns=['Ohio', 'Nevada'])

In [53]:

right2 = DataFrame([[7., 8.], [9., 10.],[11., 12.],[13., 14.]],
                  index=['b','c','d','e'],
                  columns=['Missouri','Alabana'])

In [54]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [55]:
right2

   Missouri  Alabana
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [56]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabana
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [58]:
#join方法，更方便的实现按索引合并，它还可用于合并多个带有相同或相似索引的DataFrame对象，而不管它们之间有没有重叠的列

In [63]:
left2.join(right2, how='outer')
# DataFrame的join方式是在连接键上做左连接
# 它还支持参数DataFrame的索引跟调用者DataFrame的某个列之间的连接

   Ohio  Nevada  Missouri  Alabana
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [60]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [62]:
another = DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                   index=['a','c','e','f'], columns=['New York', 'Oregon'])

In [64]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabana  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [67]:
left2.join([right2, another], how='outer',sort=True) #加一个sort = True

   Ohio  Nevada  Missouri  Alabana  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

# 轴向连接

In [68]:
#NumPy用于合并原始数组的concatenation函数

In [69]:
arr = np.arange(12.).reshape((3, 4))

In [70]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [71]:
np.concatenate([arr, arr], axis=1)

array([[ 0.,  1.,  2.,  3.,  0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.,  4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.,  8.,  9., 10., 11.]])

In [72]:
#假设有三个没有重叠索引的Series：

In [73]:
s1 = Series([0,1], index=['a', 'b'])

s2 = Series([2, 3, 4], index=['c', 'd', 'e'])

s3 = Series([5, 6], index=['f', 'g'])

In [75]:
pd.concat([s1, s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [76]:
#默认情况下。concat的axis=0，最终产生一个新的Series
#如果axis=1， 则结果就会变成一个DataFrame(axis=1是列)

In [79]:
pd.concat([s1, s2, s3], axis=1,sort = True) #加一个sort = True

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [80]:
#传入join='inner即可得到他们的交集

In [81]:
s4 = pd.concat([s1 * 5, s3])

In [86]:
pd.concat([s1, s4], axis=1, sort = True)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [87]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [88]:
#可以通过join_axes指定要在其他轴上使用的索引

In [89]:

pd.concat([s1, s4], axis=1, join_axes=[['a', 'c',  'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [90]:
#想在连接轴上创建一个层次化索引。可以使用keys参数

In [91]:
result = pd.concat([s1, s1, s3], keys=['one','two', 'three'])

In [92]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [93]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [95]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'], sort = True)#加一个sort = True

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [97]:
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b','c'],
               columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [98]:
df2 = DataFrame(int(5) + np.arange(4).reshape(2, 2), index=['a', 'c'],
               columns=['three', 'four'])
df2pd.concat([df1, df2], axis=1, keys=['level1','level2'])

   three  four
a      5     6
c      7     8

In [100]:
pd.concat([df1, df2], axis=1, keys=['level1','level2'], sort = True)#加一个sort = True

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [101]:
#如果传入的不是列表而是一个字典，则字典的键就会被当作keys选项的值

In [103]:
pd.concat({'level1':df1,'level2':df2}, axis=1,sort = True)#加一个sort = True

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [104]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a','b','c','d'])

In [105]:
df1

          a         b         c         d
0 -2.314132 -0.594049 -0.758961  0.096853
1 -1.168899  0.963939  1.635080 -0.560797
2  1.598324  0.640225 -0.192570 -0.697446

In [106]:
df2 = DataFrame(np.random.randn(2,3), columns=['b','d','a'])

In [107]:
df2

          b         d         a
0 -0.285568  0.447781  0.823976
1 -0.386219  0.174593 -0.987240

In [109]:
# 改变行索引，使原来的行索引无意义，即不保留连接轴上的索引，产生一组新索引range(total_length)
pd.concat([df1, df2], ignore_index=True, sort = True)

          a         b         c         d
0 -2.314132 -0.594049 -0.758961  0.096853
1 -1.168899  0.963939  1.635080 -0.560797
2  1.598324  0.640225 -0.192570 -0.697446
3  0.823976 -0.285568       NaN  0.447781
4 -0.987240 -0.386219       NaN  0.174593

In [111]:
pd.concat([df1, df2], sort  = True)

          a         b         c         d
0 -2.314132 -0.594049 -0.758961  0.096853
1 -1.168899  0.963939  1.635080 -0.560797
2  1.598324  0.640225 -0.192570 -0.697446
0  0.823976 -0.285568       NaN  0.447781
1 -0.987240 -0.386219       NaN  0.174593

# 合并重叠数据

In [113]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
          index=['f', 'e', 'd', 'c', 'b', 'a'])

In [114]:

b = Series(np.arange(len(a), dtype=np.float64),
           index=['f','e','d','c','b','a'])

In [115]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [116]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [117]:
b[-1] = np.nan

In [118]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [119]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [120]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [121]:
df1 = DataFrame({'a':[1., np.nan, 5., np.nan],
                'b': [np.nan, 2., np.nan, 6.],
                'c': range(2, 18, 4)})

In [122]:

df2 = DataFrame({'a':[5., 4., np.nan, 3., 7.],
                'b':[np.nan, 3., 4., 6., 8.]})

In [123]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [124]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [125]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# 2重塑和轴向旋转

In [127]:
# 重新排列表格型数据的基础运算，这些函数被称作重塑（reshape）和轴向旋转（pivot）

# 重塑层次化索引
#stack： 将数据的列旋转为行
#unstack：将数据的行旋转为列

In [128]:
data = DataFrame(np.arange(6).reshape((2, 3)),
                index=pd.Index(['Ohio','Colorado'], name='state'),
                columns=pd.Index(['one', 'two','three'], name='number'))

In [129]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [130]:
# 使用stack将列转成行，得到一个Series
result = data.stack()

In [131]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [132]:
# 对于一个层次化的Series，可以使用unstack将其重排为一个DataFrame
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [133]:
#默认情况下，unstack和stack操作的是最内层。传入分层级别的编号或名称即可对其他级别进行操作
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [134]:
# 如果不是所有的级别值都能在各分组中找到，则unstack操作会引入确实数据
s1 = Series([0,1,2,3], index=['a','b','c','d'])

s2 = Series([4, 5, 6], index=['c','d','e'])

data2 = pd.concat([s1, s2], keys=['one', 'two'], sort = True)

In [136]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [137]:

data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [138]:
#stack默认会滤出缺失数据，因此该运算时可逆的

In [139]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [140]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [141]:
#对DataFrame进行unstack进行操作时，作为旋转轴级将会成为结果中的最低级别

In [142]:
df = DataFrame({'left' : result, 'right':result + 5},
              columns=pd.Index(['left', 'right'],
                              name= 'side'))

In [143]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [144]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [145]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# 将“长格式”旋转为“宽格式”

# 3数据转换
#移除重复数据

In [146]:
# DataFrame中经常会出现重复行：
data = DataFrame({'k1':['one'] * 3 + ['two'] * 4,
                 'k2':[1, 1, 2, 3, 3, 4, 4]})

In [147]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [148]:
#DataFrame的duplicated()方法返回一个布尔型Series，表示各行是否是重复行

In [149]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [150]:
#drop_duplicates方法返回一个移除了重复行的DataFrame

In [151]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [152]:
#这两个方法默认会判断全部列，也可以指定部分列进行重复项判断
# 假设只根据k1列过滤重复计算

In [155]:
data['v1'] = range(7)

In [157]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [156]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

#利用函数或映射进行数据转换

In [158]:
data = DataFrame({'food' : ['bacon', 'pulled pork', 'bacon','Pastrami','corned beef', 'Bacon','pastrami','honey ham','nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [159]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [160]:

# 假设想添加一列表示该肉类食物来源的动物类型
# 先编写一个映射

In [161]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

#Series的map方法可以接受一个函数或含有映射关系的字典型对象

In [162]:
data['annimal'] = data['food'].map(str.lower).map(meat_to_animal)

In [163]:
data

          food  ounces annimal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [165]:
# 也可以传入一个能够完成全部工作的函数：
data['food'].map(lambda x : meat_to_animal[x.lower()])
#使用map是一种实现元素级转换以及其他数据清洗工作的便捷方式

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [167]:
data['animal'] = data['food'].map(lambda x : meat_to_animal[x.lower()])

In [168]:
data.drop('annimal', axis=1)

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

#替换值

In [169]:
data = Series([1., -999, 2., -999., -1000., 3.])

In [170]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [171]:
# -999可能是一个表示缺失数据的标记值，要将其替换为pandas能够理解的NA值，我们可以用replace来产生一个新的Series

data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [172]:
#如果希望一次传入多个值，可以传入一个由待替换值组成的列表以及一个替换值

data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [173]:
#如果希望对不同的值进行不同的替换，则传入一个由替换关系组成的列表即可

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [174]:
# 传入的参数也可以是字典

data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# 重命名轴索引
#轴标签可以向Series中的值一样，通过函数或映射进行替换;

#轴可以就地修改，无需新建一个数据结构

In [176]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                index=['Ohio','Colorado','New York'],
                columns=['one','two','three','four'])

In [177]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

#跟Series标签一样，轴标签也有一个map方法

In [178]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [179]:
# 可以直接赋值，就可以就地修改了
data.index = data.index.map(str.upper)

In [180]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [181]:
#如果是想要创建数据集的转换版本，而不是修改原始数据，可以使用rename方法

In [ ]:
# data.rename(index= str.title, columns=str.upper)

In [184]:
#rename可以结合字典型对象实现对部分轴标签的更新

data.rename(index={'OHIO': 'INDIANA'},
           columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

# 离散化和面元（bin）划分

In [185]:
# 假设有一组人员数据，而你希望将他们划分为不同的年龄组

In [186]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [187]:
# 将其划分为“18-25”，“26-35”，“35-60”以及60以上几个面元

bins = [18, 25, 35, 60, 100]

In [188]:
cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [190]:
# 返回的是一个特殊的Categorical对象，可以看做是一组表示面元名称的字符串

cats.labels  # 标号

AttributeError: 'Categorical' object has no attribute 'labels'

In [191]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [194]:
cats.levels

AttributeError: 'Categorical' object has no attribute 'levels'

In [195]:
cats.describe

<bound method Categorical.describe of [(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]>

In [196]:
cats.get_values

<bound method Categorical.get_values of [(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]>

In [197]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [198]:
# 区间开闭情况可以通过right=False修改

pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [199]:
# 可以自己设置面元名称

grouip_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']

pd.cut(ages, bins, labels=grouip_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

#如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元

In [200]:
data = np.random.randn(20)

In [201]:
pd.cut(data, 4, precision=2)  # 将数据分为4组

[(0.86, 1.88], (-0.17, 0.86], (-1.19, -0.17], (-0.17, 0.86], (-1.19, -0.17], ..., (-2.21, -1.19], (-0.17, 0.86], (-1.19, -0.17], (-1.19, -0.17], (-2.21, -1.19]]
Length: 20
Categories (4, interval[float64]): [(-2.21, -1.19] < (-1.19, -0.17] < (-0.17, 0.86] < (0.86, 1.88]]

In [202]:
data = np.random.randn(1000) # 正太分布

In [203]:
data

array([ 1.27237829e-01, -1.49869173e-01,  3.11355894e-01,  5.71020485e-01,
        1.65325173e+00, -9.81661972e-01,  3.16387607e-01,  6.09637178e-01,
        9.88957132e-01,  1.39304572e+00,  1.93596918e+00,  1.09333859e-01,
        2.72499213e-01, -2.52703625e-01, -1.13929769e+00,  1.15138545e+00,
       -5.48721588e-01, -1.16337992e+00, -1.11462939e+00, -5.37836330e-02,
        4.95350205e-01, -9.78870622e-01,  9.03910722e-01, -2.55227616e-01,
       -1.27044245e+00, -7.03767699e-01, -1.24128298e+00,  2.42765996e-01,
       -3.29397375e-01,  9.17679045e-01, -3.53504647e-01, -1.16836978e+00,
       -5.61072928e-01, -5.53651868e-01,  1.79836840e+00,  8.77072197e-01,
        1.67774345e+00,  4.82687107e-01, -5.54149663e-01, -1.39133637e+00,
       -4.28402314e-01,  2.07407523e-01, -1.34924023e-01,  9.07831557e-01,
       -1.38039897e+00,  6.00595643e-02,  5.47672186e-01,  5.56478979e-01,
       -6.80380452e-01,  1.98686022e+00, -3.73305752e-03,  1.29537217e+00,
       -1.62403607e+00, -1.15095836e+00, -1.66578030e+00,  5.11213307e-01,
       -5.39933574e-01,  7.43669611e-01,  1.40724201e+00,  7.66440126e-01,
       -2.77313173e-01,  8.91576334e-01, -5.56669648e-01, -4.03556190e-01,
        9.02425112e-01, -2.01583376e+00,  9.16830379e-01, -1.06872613e+00,
        1.52524072e+00,  4.27101326e-01,  6.42199845e-01, -1.24558860e+00,
        1.46096505e-01,  1.29494040e+00, -9.01062088e-01, -1.53402781e-01,
        7.67049948e-02, -1.19111116e+00,  1.65433579e+00,  1.22087491e-01,
        9.75021478e-01, -4.28027087e-01, -7.34284672e-02,  3.18032552e-01,
        4.04935345e-02, -1.09674969e+00, -5.28305667e-01,  4.68164618e-01,
       -6.21157056e-01, -2.66652581e-01, -1.33761067e+00, -3.72776633e-01,
       -2.40869463e-01,  4.53014314e-01, -3.27634034e-01, -8.47910122e-01,
       -1.82625596e+00,  4.51653682e-02, -1.72641120e+00, -9.13618334e-01,
        2.33779359e+00,  1.11235366e+00, -1.04713021e+00,  2.29853626e+00,
        2.43980738e-02,  6.85977127e-01, -7.21293535e-01, -1.28622350e+00,
        1.61643296e+00,  1.10433735e+00, -1.17641659e+00, -1.32430782e+00,
       -2.12135829e+00, -8.72417786e-01, -1.45394215e+00, -1.17265867e+00,
        3.13412843e-01,  4.03249067e-01, -5.97042497e-01, -7.92653245e-01,
        1.22177098e+00,  1.00040845e+00, -4.56152640e-01, -4.22023600e-01,
        5.06614667e-01,  1.49343030e+00,  1.09257532e+00,  8.20216420e-01,
        5.61715603e-01, -1.55482187e+00, -3.04506447e-01,  2.99109966e-01,
       -4.37038591e-01, -3.90372823e-01,  5.24765767e-01, -2.61743671e-01,
        1.61156490e+00, -7.79904323e-01,  1.20496645e+00, -8.58290741e-01,
        1.23899352e+00,  3.06979336e-01,  1.00162724e+00, -2.73717684e-01,
        1.13772929e+00, -1.01703273e+00,  1.44244264e+00,  1.11484518e+00,
       -1.22664325e+00, -5.69827684e-01, -1.85871439e-01,  2.68379125e+00,
        1.58623480e-01,  6.58596535e-01,  3.52381978e-01,  1.00399836e+00,
        6.10773359e-01,  3.52154505e-01,  6.76565259e-01,  1.14983556e-01,
        1.22457241e-03, -8.60678611e-02,  5.90178656e-01,  8.87721519e-01,
        8.71577514e-01, -1.54418686e-01, -4.12255577e-01, -1.59253319e-02,
        4.02496978e-01,  1.22768856e+00,  2.24299387e+00, -1.85839907e-01,
        3.25563430e-01, -2.93312665e-01, -1.86613544e-01, -2.11423322e+00,
       -8.19549912e-01,  5.25681404e-01,  5.45771340e-01,  1.15772251e-01,
        1.63760002e+00, -9.40498014e-01, -6.39565901e-01, -2.47374831e-01,
        1.30027764e-01, -6.41682968e-01, -6.85093172e-01,  1.57326138e+00,
        1.58008935e-01, -1.10580652e-01, -3.86081528e-01, -6.01831108e-02,
        9.99548936e-02,  6.15109303e-02, -1.15032634e+00, -1.12202134e+00,
        2.14653894e-01,  1.49171446e+00,  1.08131893e+00, -1.71270344e+00,
       -8.23359261e-01,  8.86183495e-01, -3.36449009e-01, -1.35211543e+00,
        1.23634255e+00, -7.30297846e-01, -5.42399912e-01, -1.35735764e+00,
       -2.56937485e-01,  5.58409926e-01, -6.19710788e-01, -1.39197318e+00,
       -3.29178954e-01,  1.42865742e+00, -9.83313342e-01,  3.59733291e-01,
        2.88457910e-01, -4.98234787e-02, -2.49087531e+00,  1.77644025e+00,
        5.17061253e-01, -8.23182713e-01, -4.70407409e-01, -5.94673881e-01,
        5.89586907e-01, -7.24388560e-03,  1.33324753e-01, -1.86473372e+00,
       -3.35291358e-02,  1.39268126e+00, -9.90509664e-01,  6.27659612e-01,
        3.21981364e-01, -1.22657949e+00, -1.37023059e+00, -2.35092815e-01,
        1.68378748e+00,  2.90980542e-01, -9.24462655e-01, -7.40243873e-01,
        6.86715327e-01,  6.84908091e-01,  3.49836978e-01, -1.49467470e+00,
       -6.79203503e-01, -9.16052869e-01, -6.35454792e-01, -8.60710366e-01,
        4.01758496e-02,  1.47498359e+00, -2.69623868e-01,  8.86012908e-01,
       -2.80890662e-01,  4.23431994e-01, -1.25925364e+00, -5.17302405e-01,
       -1.92025132e-01, -1.01002265e+00,  3.68688672e-01, -7.17537564e-01,
        2.05474608e+00, -3.54963436e-01,  3.31085820e-01,  2.85631967e+00,
       -1.30518006e-01,  7.55597669e-01,  4.11843578e-01, -1.19737149e-01,
       -8.64561985e-01, -1.03096937e+00,  8.75716090e-01, -2.05090710e+00,
        2.68769331e-01,  3.51228831e-01,  1.25761967e+00,  8.02167149e-01,
        9.05115215e-01,  9.38897540e-01,  6.64454008e-01, -7.73269075e-01,
       -1.07423364e+00, -4.70727568e-01, -1.56106425e+00, -5.58421317e-01,
        1.02253400e-01,  1.87984817e+00,  4.33583737e-01, -1.10546372e-01,
       -1.16146584e-01, -1.14306520e+00, -1.78405581e+00, -5.04211294e-01,
       -7.49361074e-01,  5.75469465e-01,  1.22209314e+00,  8.65373552e-01,
        9.60768802e-01, -1.50593696e+00,  2.26368836e-01, -1.37195210e+00,
        2.44729139e-02, -1.90096920e+00,  2.03430877e+00,  7.84841350e-01,
        1.87895942e-01,  6.53423969e-01,  5.62720453e-01,  8.12381526e-02,
       -1.45104985e+00,  1.92130919e+00, -1.05187511e+00,  1.61987311e-02,
        4.27148650e-01,  3.77602923e-01, -2.55607638e-01, -3.26127170e-01,
        5.22010937e-01, -8.09325363e-01,  5.55171558e-01, -4.33832787e-01,
        9.04496762e-01,  3.71366411e-01,  6.35837231e-01,  1.08014704e-01,
        4.25778929e-01,  1.77923481e-01,  1.69527306e-01,  6.01450385e-01,
        1.13364453e+00, -1.35120881e+00, -1.02760812e+00,  7.65821280e-01,
       -1.82196201e+00,  1.91402318e-01, -1.18585270e+00,  4.93345754e-01,
        2.02716871e-01, -1.46559770e+00, -1.93631502e+00, -3.50423204e-01,
        4.86584227e-01,  1.30041013e+00,  1.33010363e+00,  2.44845408e-01,
        5.49989603e-01,  2.47268223e-03,  1.17847522e-01,  6.10576645e-01,
        1.03913607e-01,  1.19752195e+00, -7.23345712e-01,  1.21897347e+00,
        1.50817032e+00,  1.35275488e+00, -1.15737896e+00, -1.68660991e-01,
       -6.24005244e-01, -4.71723003e-01,  5.28229027e-01, -3.73901150e-01,
        1.29272682e+00, -4.41189699e-01,  1.91846064e-01, -4.35864788e-01,
        1.00282381e-01,  2.43374235e-01,  1.25252889e+00, -9.81919210e-02,
       -8.96545844e-01,  1.68276702e+00, -8.00165606e-01, -7.08880470e-01,
        1.63234935e+00,  1.34362077e+00, -3.55162963e-01, -9.37285263e-02,
       -3.71871572e-01, -6.83063191e-01,  6.53481423e-01,  8.25061305e-01,
       -9.46981083e-01, -1.63129988e+00,  1.67480565e-01, -1.91872087e+00,
       -1.75536516e+00,  6.39799244e-01,  2.76206132e+00, -7.41893082e-01,
        8.10260503e-01,  9.82296387e-01,  5.37835645e-01, -5.29212376e-01,
       -3.97737861e-01, -5.87769862e-01, -4.11364942e-01,  1.76624634e+00,
        5.42372744e-01, -4.82773895e-01,  2.02279730e-01, -1.64758081e+00,
       -1.25928382e+00,  1.28702987e+00,  2.62895979e-01,  1.19877275e+00,
        9.26416971e-02, -4.01002817e-01, -3.02056846e-01, -1.49702294e-02,
        2.53225551e+00, -5.24709774e-01,  6.75294642e-01, -4.13811226e-01,
        9.61476108e-01, -1.08356016e+00,  5.67097496e-01, -2.07924763e+00,
       -4.72581295e-01, -1.38286308e+00, -1.07439711e+00, -4.13939393e-01,
       -8.10851630e-01, -6.74970710e-01,  7.82714330e-01,  7.10657556e-01,
        2.38333991e-01,  2.72153390e-01, -1.66647866e-01,  9.30161606e-01,
       -2.53818671e-01,  1.36313865e+00, -3.73876078e-01,  7.82234146e-01,
       -1.84277517e+00, -7.08904379e-01,  3.13799757e-01, -5.47112074e-01,
        1.19625976e+00, -5.16978613e-01, -7.04648731e-01,  1.34044465e+00,
       -8.47262013e-01, -1.89176727e-02, -5.23987261e-01, -4.74110320e-01,
       -1.24426340e+00, -2.29881239e+00, -5.48126268e-01, -4.08956220e-01,
       -1.05413456e+00,  2.71007168e-01, -2.35815932e-01,  1.89779984e+00,
       -3.31278849e-01,  4.92381900e-01, -5.18681276e-01, -1.06390671e+00,
       -1.58508988e-01,  1.30960775e-01,  4.34981263e-01, -2.03797626e+00,
        2.29945116e+00,  2.61220449e-01,  1.12064010e+00,  8.76168446e-01,
       -1.03362052e+00,  6.53781455e-01, -1.26843504e-01, -2.36770933e+00,
       -3.75116681e-01, -7.33469392e-01,  1.36340988e+00,  9.94690023e-01,
        1.73299279e+00, -4.77175245e-01,  1.95786354e-01, -9.54869966e-01,
        7.11611001e-01, -3.73066667e-01,  4.15884349e-01, -6.24647228e-01,
        2.44299031e+00,  8.86313960e-01,  8.05398390e-01,  1.08343445e+00,
        3.43906063e-01, -1.27991690e-01, -1.43295597e-01, -6.19490169e-01,
       -1.12647787e+00,  4.14431747e-01,  2.19612880e+00, -5.47266860e-01,
        4.18992297e-01, -7.23985355e-02, -1.14545200e+00,  9.61125967e-01,
        5.69596629e-01, -1.32526093e+00,  6.09642685e-01, -1.49927405e+00,
        1.09797827e+00,  3.96602196e-01, -7.82154134e-01,  6.23847658e-02,
       -1.80293091e-01,  1.32201521e+00, -2.89646076e-01, -1.94618860e-01,
        5.92212552e-01,  1.38602651e+00,  6.43831477e-01, -4.58829958e-01,
       -5.60031364e-02, -7.63401830e-01,  3.91080780e-01,  1.01294596e+00,
       -2.76866896e-01, -1.27791835e+00,  1.12584352e-01, -3.74196850e-01,
        1.42577659e+00,  1.70444715e+00, -1.05641760e+00, -5.21991821e-01,
        9.00538710e-01, -1.06947303e-01,  8.48901987e-01,  1.70503745e-01,
        7.82269045e-02, -5.01790770e-01, -2.63099746e-01, -8.94067559e-01,
       -3.30348301e-01,  2.76881734e-01,  1.02597349e+00,  4.83653485e-01,
        1.45311072e-01,  1.48869091e+00,  8.47368664e-01,  8.71053884e-01,
        6.85031255e-01,  5.16201367e-01, -2.70523537e-01,  2.92349197e+00,
        1.29796554e+00, -7.11618434e-01, -1.07028694e+00,  9.31082794e-01,
       -1.34836768e-01,  1.22072024e-01,  4.11178343e-01, -5.48840323e-01,
       -1.05759830e+00, -9.69430032e-02,  6.28909859e-01, -1.58163094e+00,
        8.15112718e-02,  1.27150582e+00, -2.02226099e+00, -8.87260066e-01,
       -8.10004862e-01,  1.76279670e+00, -1.13812449e+00, -1.39814386e+00,
       -4.98250455e-01, -1.46258191e+00,  8.23146909e-01, -1.97543557e+00,
       -1.25247460e+00, -4.61749889e-02,  1.81301114e+00,  1.80824055e+00,
        1.60537115e-01,  9.23146194e-01,  1.89253763e-01,  1.17838924e+00,
        4.44758805e-01,  8.64552585e-01,  7.94582809e-03, -9.87788926e-02,
       -1.45264606e-01,  1.16872664e+00,  1.12421182e+00,  1.32334766e+00,
        2.78045194e-01,  4.08057054e-02,  8.29075843e-01,  1.82100832e-01,
        3.70066875e-01, -1.74839610e+00,  7.69374118e-01, -3.83014109e-01,
       -1.40366434e+00,  3.09885786e-01,  2.20349860e-01,  8.21907421e-01,
        1.44656962e-01, -3.00721071e-01,  3.09139684e-01, -1.51720137e+00,
       -1.75249667e+00,  9.13178747e-01,  1.62987400e+00, -4.35405996e-01,
        1.01654812e+00,  3.82881575e-01, -1.94708169e+00, -2.35562254e-01,
        3.41395917e-02, -2.97279945e-01, -8.19491511e-01, -4.84125542e-01,
        1.64492317e-01,  4.19624342e-01,  5.52961050e-01, -1.23375664e+00,
       -6.70284493e-01,  5.26796967e-01, -1.90062656e+00,  2.60175185e-01,
       -2.10168269e+00,  6.90159826e-01,  6.02997288e-02,  1.64888811e+00,
       -4.34704076e-01,  1.50258125e-01,  4.34019714e-01, -1.56366331e-02,
       -2.01222385e+00,  1.29818908e-02,  5.53309692e-01,  2.07354626e+00,
       -2.46823300e+00,  8.25087778e-01,  1.40581476e+00, -4.24319876e-01,
       -1.49050062e+00,  3.04784362e-01,  5.08256066e-01,  2.71707190e-01,
       -1.24806748e+00,  4.79975028e-02, -5.56321038e-01, -6.90561191e-01,
        1.29182210e+00, -2.28538297e-01,  4.10581828e-01,  5.16982851e-01,
       -3.85175974e-01,  1.75276523e-01, -1.91759174e+00, -7.04699409e-01,
       -1.09611829e+00, -1.34387634e+00, -8.30679244e-01, -6.27069014e-01,
        2.05397331e-01,  1.07214251e+00,  9.95106880e-01,  3.53773443e-01,
       -1.26728797e+00,  5.19029818e-01,  8.04564155e-01, -1.04908702e+00,
        7.55078214e-01,  1.33101284e+00, -1.20081731e+00,  7.12364363e-01,
       -1.77163510e+00,  2.60477771e-01, -4.89330002e-01,  6.62306917e-01,
        2.55016407e-01, -1.21660293e+00,  8.82480731e-01, -1.16134543e-01,
       -7.82541315e-02, -5.99413881e-01, -1.25727289e+00,  1.59256223e+00,
       -2.00990049e+00, -2.09123850e+00,  1.44263287e+00,  1.78672537e-01,
       -1.38055357e+00,  3.46493975e-01,  2.45430242e-01,  1.13116844e+00,
        2.22452317e-01, -6.56817994e-01,  2.64415915e-01,  7.29649526e-02,
        4.71160333e-01, -1.49972932e+00, -1.03218312e+00,  2.22534091e-01,
        1.33625632e+00, -4.89742307e-01, -2.64292987e-01,  6.00774055e-01,
        1.43381660e+00,  1.74360080e+00, -1.28787791e+00, -6.41942592e-01,
       -2.55966005e+00, -4.75799781e-01, -1.12939083e+00, -1.17566177e+00,
        2.43995647e+00,  6.26039718e-02,  1.61781029e+00, -2.71361300e-01,
        5.31362916e-01,  6.34085585e-02, -3.77628871e-01, -1.46704866e+00,
        8.95303314e-01,  6.14095918e-01, -5.17357295e-01, -6.93156571e-02,
        1.46477508e+00,  1.25076754e+00,  7.21207970e-01, -1.50159676e+00,
       -6.67936968e-01, -1.29668109e+00, -1.78185023e-02,  5.20838068e-01,
        1.20449556e-01,  9.72334817e-01, -1.10827921e+00, -1.03699968e+00,
        1.32481707e+00,  1.62119479e-01, -8.83350751e-01, -1.37721940e+00,
        2.67218891e-01, -1.01327125e+00, -2.86805368e-01, -6.21797609e-01,
       -9.53418274e-01,  7.59305660e-01,  1.75819586e+00, -1.01248215e+00,
        6.51804996e-01,  5.99747949e-01,  1.49389360e+00,  1.20473517e-01,
       -2.44153476e-02,  1.69872088e-01, -1.56866043e-01,  9.57859136e-01,
       -5.07774313e-01,  7.37755689e-01,  1.09272919e+00,  4.67067821e-01,
       -1.02020357e+00, -1.80360621e-01, -8.49553829e-01, -2.11054521e-01,
        1.14865639e+00, -1.28190858e+00, -1.65342204e+00,  7.74456041e-01,
       -2.29254546e-01,  2.50220489e-01, -5.53325413e-01, -6.69999040e-01,
       -1.32959002e+00, -3.42299791e-01,  3.59054814e-01,  1.44435443e+00,
        7.04023568e-01, -3.99759679e-01,  1.88958550e-01,  5.71011506e-01,
        1.06433388e+00,  2.04590014e+00, -5.88783397e-01,  2.22831611e+00,
       -3.11088958e-01,  8.72828742e-01, -2.39692860e+00,  9.27174482e-01,
       -2.57085163e-01,  1.77324705e+00, -1.01382870e+00,  2.47134999e-02,
        3.01338523e+00, -7.47245793e-01,  3.11915859e-01,  2.56675532e-01,
        2.81431121e-01,  2.73139365e-01,  1.25427559e-01, -1.09803377e+00,
       -2.41172033e-01, -4.15957589e-02,  1.52304921e-01, -1.97296781e-01,
       -3.85172030e-01, -1.02766478e+00, -7.74941624e-01, -6.87494302e-01,
       -4.10679923e-02, -7.61361045e-01,  4.19750737e-01, -2.22035649e+00,
        9.40513899e-01, -9.75742983e-01, -8.87793757e-01, -6.27717321e-01,
       -2.90968659e-01,  9.34946804e-01,  5.94424657e-01,  2.24309964e+00,
        1.06384736e+00, -7.80845259e-01,  7.46738952e-01,  3.60140168e-01,
        6.65663740e-01, -1.41820980e+00,  1.45913069e+00,  2.92492876e-01,
       -1.20654837e-01, -1.27226922e-01,  4.31173678e-01,  2.27208592e+00,
        4.49548631e-01,  1.95407031e-01, -4.78555679e-01,  9.31825619e-01,
       -5.61469359e-01,  8.52279422e-01,  8.00272078e-02,  9.43863368e-02,
        1.43472542e+00, -2.35436568e-02,  2.18021399e-01, -5.92897572e-01,
       -2.04538644e-01,  6.98055418e-01, -9.05552206e-01, -6.08066484e-01,
       -6.35698843e-01,  1.13828178e+00, -9.52544008e-01,  4.06378139e-01,
        1.15926752e+00, -4.05175814e-01, -2.00063774e-01,  2.21448581e-01,
        3.92986115e-01, -3.54502195e+00, -1.44164048e+00, -7.51045281e-01,
       -8.37246655e-01, -1.29563447e-01,  3.53337900e-01,  1.48641855e+00,
       -9.54101810e-01,  2.45559829e+00, -2.24666703e-01,  1.36869849e-01,
       -1.35730247e+00, -8.44452506e-01, -3.41600884e-02,  1.21080318e+00,
        5.54768927e-01,  8.72693329e-01,  2.31339583e+00, -5.92600523e-01,
        1.02341037e+00, -7.19477817e-01, -3.81850932e-01,  9.16183487e-01,
       -9.35517011e-01,  3.71848513e-01, -3.69915777e-01,  8.19413507e-01,
       -1.47278869e+00, -4.68104886e-01, -2.26188291e+00, -2.68830425e-01,
       -8.20561390e-01, -4.30417547e-01, -5.71045225e-01,  2.65223740e+00,
        4.28199412e-01,  4.96196940e-01, -2.58676538e-01, -4.30153678e-01,
        2.83405793e-01, -4.88289333e-01, -6.39024784e-01,  1.37627297e+00,
       -4.18811518e-02,  7.59766902e-01,  2.25174104e-02, -1.21962722e+00,
        3.48071907e-01,  1.64233255e+00, -9.82512341e-01,  3.01970509e-01,
        1.35566813e+00,  2.34905245e-01,  1.54402451e-02, -6.88467544e-01,
        6.71853655e-01, -2.33493743e-01, -1.14566755e+00, -8.47243748e-02,
       -1.67701995e-01, -2.66608997e-01, -1.63696499e+00, -6.43062268e-01,
        8.20693297e-01,  3.10844109e+00,  3.14785125e-01, -4.64292591e-01,
        1.23833476e+00, -7.57098281e-01,  3.73931233e-01,  7.62502127e-01,
        1.68387836e+00,  9.12851191e-01, -1.31955101e+00,  9.84385964e-01,
        2.13454718e+00, -4.39166053e-01, -1.09231245e+00,  3.66680906e-01,
       -1.38846125e+00,  2.38814615e-01, -1.04474921e-01,  1.09078090e+00,
        2.98374516e-01, -8.75139621e-01,  6.23533276e-01, -5.98257933e-02,
        5.47023510e-01,  3.73666816e-02, -8.88317001e-01, -2.63579182e-01,
       -7.47962515e-01,  7.46329150e-01, -8.22538270e-01,  5.42391314e-01,
       -1.28070198e+00, -2.79046748e-02, -1.22669780e+00, -1.07865383e+00,
        1.22684051e+00, -8.36234228e-01, -5.00908811e-02, -1.43391954e-01,
        5.89526501e-02,  2.97973814e-01, -1.02727301e+00, -2.74503317e-01,
       -3.30747634e-01,  4.03094919e-01,  5.14084195e-01,  8.90062400e-01,
       -1.04271491e+00,  8.09918985e-01,  1.46171941e-01, -4.09629312e-01,
        5.55667909e-01, -1.27660232e+00, -2.31102847e-01, -1.61210441e+00,
        2.49964255e+00, -6.80689927e-01,  1.29882486e-01,  5.95386799e-01,
        4.52475374e-01, -2.55923867e-01,  8.16862319e-01, -8.15658222e-01,
        9.16433438e-01,  1.54683720e+00, -9.55325717e-01,  7.09226860e-01,
       -2.45473678e+00, -9.11714166e-01,  1.03886444e+00, -4.19839874e-01,
        1.17089736e+00, -1.08322471e+00,  6.31134076e-01, -1.63315433e-01,
       -5.31913645e-01,  1.09284968e+00, -8.00736135e-01,  8.61552439e-01,
       -5.42071090e-01, -7.65376324e-01, -1.71218179e+00, -5.22523012e-01])

In [204]:
cats = pd.qcut(data, 4) # 按四分位数进行切割

In [205]:
cats

[(0.0244, 0.663], (-0.67, 0.0244], (0.0244, 0.663], (0.0244, 0.663], (0.663, 3.108], ..., (0.663, 3.108], (-0.67, 0.0244], (-3.546, -0.67], (-3.546, -0.67], (-0.67, 0.0244]]
Length: 1000
Categories (4, interval[float64]): [(-3.546, -0.67] < (-0.67, 0.0244] < (0.0244, 0.663] < (0.663, 3.108]]

In [206]:
pd.value_counts(cats)

(0.663, 3.108]     250
(0.0244, 0.663]    250
(-0.67, 0.0244]    250
(-3.546, -0.67]    250
dtype: int64

In [207]:
# 也可以设置自定义的分位数（0-1之间的值，包含端点）
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0244, 1.288], (-1.246, 0.0244], (0.0244, 1.288], (0.0244, 1.288], (1.288, 3.108], ..., (0.0244, 1.288], (-1.246, 0.0244], (-1.246, 0.0244], (-3.546, -1.246], (-1.246, 0.0244]]
Length: 1000
Categories (4, interval[float64]): [(-3.546, -1.246] < (-1.246, 0.0244] < (0.0244, 1.288] < (1.288, 3.108]]

# 检测和过滤异常值

#异常值也叫孤立点和离群值

In [208]:
np.random.seed(12345)

In [209]:
data = DataFrame(np.random.rand(1000, 4))

In [210]:
data

            0         1         2         3
0    0.929616  0.316376  0.183919  0.204560
1    0.567725  0.595545  0.964515  0.653177
2    0.748907  0.653570  0.747715  0.961307
3    0.008388  0.106444  0.298704  0.656411
4    0.809813  0.872176  0.964648  0.723685
5    0.642475  0.717454  0.467599  0.325585
6    0.439645  0.729689  0.994015  0.676874
7    0.790823  0.170914  0.026849  0.800370
8    0.903723  0.024676  0.491747  0.526255
9    0.596366  0.051958  0.895090  0.728266
10   0.818350  0.500223  0.810189  0.095969
11   0.218950  0.258719  0.468106  0.459373
12   0.709510  0.178053  0.531450  0.167742
13   0.768814  0.928171  0.609494  0.150183
14   0.489627  0.377345  0.848601  0.911097
15   0.383849  0.315496  0.568394  0.187818
16   0.125842  0.687596  0.799607  0.573537
17   0.973230  0.634054  0.888422  0.495415
18   0.351617  0.714230  0.503929  0.225638
19   0.244974  0.792801  0.495172  0.915094
20   0.945372  0.533232  0.252493  0.720862
21   0.367439  0.498648  0.226575  0.353566
22   0.650852  0.312933  0.768735  0.781837
23   0.852409  0.949906  0.107323  0.910725
24   0.336055  0.826380  0.898101  0.042715
25   0.195795  0.294501  0.627000  0.086223
26   0.142945  0.515827  0.689341  0.856626
27   0.647362  0.581619  0.711116  0.252417
28   0.900160  0.442294  0.020521  0.959661
29   0.652225  0.513206  0.682356  0.489540
..        ...       ...       ...       ...
970  0.701877  0.026760  0.947606  0.125988
971  0.327318  0.166397  0.198278  0.870063
972  0.658191  0.633484  0.377935  0.080598
973  0.826856  0.271068  0.377182  0.013486
974  0.845719  0.097079  0.365333  0.543104
975  0.590818  0.304318  0.852729  0.800925
976  0.895972  0.431031  0.768476  0.717613
977  0.839312  0.687873  0.188512  0.152224
978  0.275592  0.525430  0.857056  0.994779
979  0.784606  0.549583  0.137010  0.107994
980  0.028226  0.184355  0.513341  0.755895
981  0.780995  0.579034  0.168113  0.446520
982  0.191020  0.036587  0.656229  0.294891
983  0.746387  0.855917  0.519012  0.724993
984  0.474907  0.294701  0.957084  0.706165
985  0.200043  0.328289  0.881357  0.769124
986  0.087718  0.913559  0.293873  0.366669
987  0.219531  0.890127  0.748516  0.024140
988  0.855824  0.848365  0.195675  0.355401
989  0.238440  0.917796  0.701774  0.059642
990  0.889363  0.462737  0.476925  0.593465
991  0.772661  0.855945  0.854699  0.150214
992  0.235711  0.933316  0.669488  0.764700
993  0.878445  0.185726  0.594084  0.924867
994  0.456028  0.594702  0.282708  0.541134
995  0.493101  0.614967  0.423814  0.594771
996  0.508256  0.828686  0.861175  0.725067
997  0.954657  0.733794  0.488558  0.078268
998  0.368385  0.767890  0.525692  0.669292
999  0.658867  0.175471  0.734137  0.067593

[1000 rows x 4 columns]

In [211]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.511135     0.500621     0.508352     0.486790
std       0.283375     0.285126     0.285184     0.291055
min       0.000965     0.001066     0.000954     0.000107
25%       0.262958     0.252552     0.268742     0.224885
50%       0.529987     0.501589     0.508872     0.481945
75%       0.757060     0.752059     0.755518     0.727557
max       0.999414     0.993529     0.998926     0.996174

In [212]:
# 假设想找出某列中绝对值大小超过3的值

col = data[3]

col[np.abs(col) > 3]

Series([], Name: 3, dtype: float64)

In [213]:
# 选出全部含有“超过2或-2的值”的行，可以利用布尔型DataFrame以及any方法：
data[(np.abs(data) > 2).any(1)]

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [214]:
# 下面的代码可以将值限制在区间-3到3以内

data[np.abs(data) > 3] = np.sign(data) * 3   #np.sign返回的是一个由1和-1组成的数组，表示原始值的符号

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.511135     0.500621     0.508352     0.486790
std       0.283375     0.285126     0.285184     0.291055
min       0.000965     0.001066     0.000954     0.000107
25%       0.262958     0.252552     0.268742     0.224885
50%       0.529987     0.501589     0.508872     0.481945
75%       0.757060     0.752059     0.755518     0.727557
max       0.999414     0.993529     0.998926     0.996174

# 排列和随机采样

In [215]:
# 通过需要排列的轴的长度调用permutation，可产生一个表示新殊勋的整数数组
df = DataFrame(np.arange(5 * 4).reshape(5, 4))

In [216]:
sampler = np.random.permutation(5)

In [217]:
sampler

array([0, 1, 3, 4, 2])

In [218]:
# 然后就可以基于ix的索引操作或take函数中使用该数组了
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [219]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

#如果不想用替换的方式选取随机子集，可以使用permutation：从permutation返回的数组中切下前k个元素，期中ke为期望的子集大小

In [220]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [221]:
# 要通过替换的方式产生样本，最快的方式是通过np.random.randint得到一组随机整数
bag = np.array([5, 7, -1, 6, 4])

In [222]:
sampler = np.random.randint(0, len(bag), size=10)

In [223]:
sampler

array([2, 2, 1, 0, 4, 0, 3, 2, 0, 2])

In [224]:
draws = bag.take(sampler)

In [225]:
draws

array([-1, -1,  7,  5,  4,  5,  6, -1,  5, -1])

# 计算指标\哑变量

另一种常用语统计建模或机器学习的转换方式是：将分类变量（categorical variable）转换为“哑变量矩阵”（dummy matrix）或“指标矩阵”（indicator matrix）

如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0）

pandas有一个get_dummies函数可以实现此功能

In [226]:
df = DataFrame({'key':['b','b','a','c','a','b'],
               'data1':range(6)})

In [227]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [228]:
# 有时候想给DataFrame的列加一个前缀，以便能够跟其他数据进行合并，get_dummies的prefix参数可以实现该功能
dummies = pd.get_dummies(df['key'], prefix='key')

In [229]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [230]:
df_with_dummy = df[['data1']].join(dummies)

In [231]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

#如果df中某行同属于多个分类，则事情就会变得有点复杂

In [232]:

mnames = ['movie_id', 'title', 'genres']

In [233]:
movies = pd.read_table('ch02/movielens/movies.dat', sep='::', header=None, names=mnames)

D:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.
D:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

FileNotFoundError: [Errno 2] No such file or directory: 'ch02/movielens/movies.dat'

# 4 字符串操作

# 字符串对象方法

In [235]:
val = 'a,b, guido'

In [236]:
val.split(',')

['a', 'b', ' guido']

In [237]:
#strip可以去掉空格
pieces = [x.strip() for x in val.split(',')]

In [238]:
pieces

['a', 'b', 'guido']

In [239]:
first, second, thrid = pieces

In [240]:
first

'a'

In [241]:
first + '::' + second + '::' + thrid

'a::b::guido'

#检测子串的最佳方式是利用Python的in关键字

In [242]:
'guido' in val

True

In [243]:
val.index(',')

1

In [244]:
val.find(':')

-1

#find和index的区别：如果找不到字符串，index会引发一个异常，find会返回-1

In [245]:
val.index(':')

ValueError: substring not found

#count函数用于返回指定子串的出现次数

In [246]:
val.count(',')

2

#replace用于将指定模式替换为另一个模式，它也尝尝用于删除模式：传入空字符串

In [247]:
val.replace(',', '::')

'a::b:: guido'

In [248]:
val.replace(',','')

'ab guido'

# 正则表达式

In [249]:
import re

In [250]:
text = "foo bar\t baz \tqux"

In [251]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [252]:
regex = re.compile('\s+')

In [253]:

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [254]:
regex.findall(text)      # 找到匹配regex的所有模式

[' ', '\t ', ' \t']

findall返回的是字符串所有的匹配项，search只返回第一个匹配项

match更加严格，只匹配字符串的首部

In [255]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""

In [256]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [257]:
regex = re.compile(pattern, flags=re.IGNORECASE)       # re.IGNORECASE作用是使正则表达式对大小不敏感

In [258]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [259]:
m = regex.search(text)      # search返回的是文本中第一个电子邮件地址（以特殊的匹配对象形式返回），
#对于上述regex，匹配对象只能告诉我们模式在原字符串初中起始和结束位置

In [260]:
m

In [261]:

text[m.start():m.end()]

'dave@google.com'

In [264]:
# regex.macth返回None，因为它只匹配出现在字符串开头的模式：
print regex.match(text)

SyntaxError: invalid syntax (<ipython-input-264-d94abe38b55a>, line 2)

In [265]:
# sub方法，将匹配到的模式替换为指定字符串，并返回所得到的新字符串
print regex.sub('REDACTED', text)

SyntaxError: invalid syntax (<ipython-input-265-84e0be4180e6>, line 2)

假设不仅想要找出电子邮件地址，还想将各个地址分成3部分，包括：用户名、域名以及域后缀

要实现此功能，只需要将待分段的模式的各部分用圆括号包起来即可

In [266]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [267]:
regex = re.compile(pattern, flags=re.IGNORECASE)

由这种正则所产生的匹配对象，可以通过其groups方法返回一个由模式各段组成的元祖：

In [268]:
m = regex.match('wesm@bright.net')

In [269]:
m.groups()

('wesm', 'bright', 'net')

In [270]:
# 对于带有分组功能的模式，findall会返回一个元祖列表
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [271]:
# sub还能通过注入\1, \2之类的特殊符号访问各匹配项中的分组
print regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text)

SyntaxError: invalid syntax (<ipython-input-271-f1096b8a3dfe>, line 2)

In [272]:
regex = re.compile(r"""
(?P<username>[A-Z0-9._%+-]+)
@
(?P<domain>[A-Z0-9._]+)
\.
(?P<suffix>[A-Z]{2,4})
""", flags=re.IGNORECASE|re.VERBOSE)

In [273]:
m = regex.match('werm@bright.net')

In [274]:
m

In [275]:
m.groupdict()

{'username': 'werm', 'domain': 'bright', 'suffix': 'net'}

In [276]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

# pandas中矢量化的字符串函数

In [277]:
data = {'Dave':'dave@google.com','Stave':'stave@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}

In [278]:
data = Series(data)

In [279]:
data

Dave     dave@google.com
Stave    stave@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [280]:
data.isnull()

Dave     False
Stave    False
Rob      False
Wes       True
dtype: bool

data.map，所有字符串和正则表达式都能被应用于（传入lambda表达式或其他函数）各个值，但是如果存在NA值就会报错

In [281]:
data.str.contains('gmail')

Dave     False
Stave     True
Rob       True
Wes        NaN
dtype: object

In [282]:

pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [283]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Stave    [(stave, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

# 有两个办法可以实现矢量化的元素获取操作：

1.使用str.get

2.在str属性上使用索引

In [284]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [285]:
matches

Dave     True
Stave    True
Rob      True
Wes       NaN
dtype: object

In [286]:
matches.str.get(1)

Dave    NaN
Stave   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [287]:
matches.str[0]

Dave    NaN
Stave   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [288]:
data.str[:5]

Dave     dave@
Stave    stave
Rob      rob@g
Wes        NaN
dtype: object

# 5实例：USDA食品数据库

In [292]:
import json

db = json.load(open(r'C:\Users\Administrator\Desktop\新一期DataAnalysis\PythonForDataAnalysis\ch07\foods-2011-10-03.json'))

len(db)

6636

In [293]:
# db中的每个条目都是一个含有某种食物全部数据的字典
# nutrients字段是一个字典列表，其中的每个字典对应一种营养成分

In [294]:
db[0].keys()

dict_keys(['id', 'description', 'tags', 'manufacturer', 'group', 'portions', 'nutrients'])

In [295]:

db[0]['nutrients'][0]

{'value': 25.18,
 'units': 'g',
 'description': 'Protein',
 'group': 'Composition'}

In [296]:

nutrients = DataFrame(db[0]['nutrients'])

In [297]:

nutrients[:20]

                    description        group units     value
0                       Protein  Composition     g    25.180
1             Total lipid (fat)  Composition     g    29.200
2   Carbohydrate, by difference  Composition     g     3.060
3                           Ash        Other     g     3.280
4                        Energy       Energy  kcal   376.000
5                         Water  Composition     g    39.280
6                        Energy       Energy    kJ  1573.000
7          Fiber, total dietary  Composition     g     0.000
8                   Calcium, Ca     Elements    mg   673.000
9                      Iron, Fe     Elements    mg     0.640
10                Magnesium, Mg     Elements    mg    22.000
11                Phosphorus, P     Elements    mg   490.000
12                 Potassium, K     Elements    mg    93.000
13                   Sodium, Na     Elements    mg   690.000
14                     Zinc, Zn     Elements    mg     2.940
15                   Copper, Cu     Elements    mg     0.024
16                Manganese, Mn     Elements    mg     0.021
17                 Selenium, Se     Elements   mcg    14.500
18                Vitamin A, IU     Vitamins    IU  1054.000
19                      Retinol     Vitamins   mcg   262.000

In [298]:
# 在将字典列表转换为DataFrame时，可以只抽取其中的一部分字段，这里，我们将抽取食物的名称、分类、编号以及制造商等信息

In [299]:
info_keys = ['description','group','id','manufacturer']

In [300]:
info = DataFrame(db, columns=info_keys)

In [301]:
info[:12]

,description,group,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,
5,"Cheese, mozzarella, part skim milk, low moisture",Dairy and Egg Products,1029,
6,"Cheese, romano",Dairy and Egg Products,1038,
7,"Cheese, roquefort",Dairy and Egg Products,1039,
8,"Cheese spread, pasteurized process, american, ...",Dairy and Egg Products,1048,
9,"Cream, fluid, half and half",Dairy and Egg Products,1049,
10,"Sour dressing, non-butterfat, cultured, filled...",Dairy and Egg Products,1058,
11,"Milk, filled, fluid, with blend of hydrogenate...",Dairy and Egg Products,1059,

In [302]:
info

,description,group,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,
5,"Cheese, mozzarella, part skim milk, low moisture",Dairy and Egg Products,1029,
6,"Cheese, romano",Dairy and Egg Products,1038,
7,"Cheese, roquefort",Dairy and Egg Products,1039,
8,"Cheese spread, pasteurized process, american, ...",Dairy and Egg Products,1048,
9,"Cream, fluid, half and half",Dairy and Egg Products,1049,
10,"Sour dressing, non-butterfat, cultured, filled...",Dairy and Egg Products,1058,
11,"Milk, filled, fluid, with blend of hydrogenate...",Dairy and Egg Products,1059,
12,"Cream substitute, liquid, with lauric acid oil...",Dairy and Egg Products,1068,
13,"Cream substitute, powdered",Dairy and Egg Products,1069,
14,"Milk, producer, fluid, 3.7% milkfat",Dairy and Egg Products,1078,
15,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1079,None
16,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1080,
17,"Milk, reduced fat, fluid, 2% milkfat, protein ...",Dairy and Egg Products,1081,
18,"Milk, lowfat, fluid, 1% milkfat, with added vi...",Dairy and Egg Products,1082,
19,"Milk, lowfat, fluid, 1% milkfat, with added no...",Dairy and Egg Products,1083,
20,"Milk, lowfat, fluid, 1% milkfat, protein forti...",Dairy and Egg Products,1084,
21,"Milk, nonfat, fluid, with added vitamin A and ...",Dairy and Egg Products,1085,
22,"Milk, nonfat, fluid, with added nonfat milk so...",Dairy and Egg Products,1086,
23,"Milk, nonfat, fluid, protein fortified, with a...",Dairy and Egg Products,1087,
24,"Milk, buttermilk, fluid, cultured, lowfat",Dairy and Egg Products,1088,
25,"Milk, low sodium, fluid",Dairy and Egg Products,1089,
26,"Milk, dry, whole, with added vitamin D",Dairy and Egg Products,1090,
27,"Milk, dry, nonfat, regular, without added vita...",Dairy and Egg Products,1091,
28,"Milk, dry, nonfat, instant, with added vitamin...",Dairy and Egg Products,1092,
29,"Milk, dry, nonfat, calcium reduced",Dairy and Egg Products,1093,
...,...,...,...,...
6606,"Beef, tenderloin, steak, separable lean only, ...",Beef Products,23628,
6607,"Beef, top sirloin, steak, separable lean only,...",Beef Products,23629,
6608,"Beef, short loin, top loin, steak, separable l...",Beef Products,23630,
6609,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23631,
6610,"Beef, brisket, flat half, separable lean only,...",Beef Products,23632,
6611,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23633,
6612,"Beef, brisket, flat half, separable lean only,...",Beef Products,23634,
6613,"Beef, round, eye of round, roast, separable le...",Beef Products,23635,
6614,"Beef, round, top round, steak, separable lean ...",Beef Products,23636,
6615,"Beef, round, bottom round, roast, separable le...",Beef Products,23637,
6616,"Beef, rib, small end (ribs 10-12), separable l...",Beef Products,23638,
6617,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27015,Campbell Soup Co.
6618,"CAMPBELL Soup Company, CAMPBELL's Red and Whit...","Soups, Sauces, and Gravies",27016,Campbell Soup Co.
6619,"CAMPBELL Soup Company, CAMPBELL'S SELECT Soups...","Soups, Sauces, and Gravies",27021,Campbell Soup Co.
6620,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27022,Campbell Soup Co.
6621,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27023,Campbell Soup Co.
6622,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27024,Campbell Soup Co.
6623,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27025,Campbell Soup Co.
6624,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27026,Campbell Soup Co.
6625,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27032,Campbell Soup Co.
6626,"CAMPBELL Soup Company, V8 Vegetable Juice, Ess...",Vegetables and Vegetable Products,31010,Campbell Soup Co.
6627,"CAMPBELL Soup Company, V8 Vegetable Juice, Spi...",Vegetables and Vegetable Products,31013,Campbell Soup Co.
6628,"CAMPBELL Soup Company, PACE, Jalapenos Nacho S...",Vegetables and Vegetable Products,31014,Campbell Soup Co.
6629,"CAMPBELL Soup Company, V8 60% Vegetable Juice,...",Vegetables and Vegetable Products,31016,Campbell Soup Co.
6630,"CAMPBELL Soup Company, V8 Vegetable Juice, Low...",Vegetables and Vegetable Products,31017,Campbell Soup Co.
6631,"Bologna, beef, low fat",Sausages and Luncheon Meats,42161,
6632,"Turkey and pork sausage, fresh, bulk, patty or...",Sausages and Luncheon Meats,42173,
6633,"Babyfood, juice, pear",Baby Foods,43408,None
6634,"Babyfood, dessert, banana yogurt, strained",Baby Foods,43539,None
6635,"Babyfood, banana no tapioca, strained",Baby Foods,43546,None

In [304]:
# 通过value_counts,可以查看食物# 将各个食物的营养成分整合到一个大表中
nutrients = []
for rec in db:
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)

nutrients = pd.concat(nutrients, ignore_index=True)类别的分部情况
pd.value_counts(info.group)[:10]

Vegetables and Vegetable Products    812
Beef Products                        618
Baked Products                       496
Breakfast Cereals                    403
Legumes and Legume Products          365
Fast Foods                           365
Lamb, Veal, and Game Products        345
Sweets                               341
Fruits and Fruit Juices              328
Pork Products                        328
Name: group, dtype: int64

In [309]:
# 将各个食物的营养成分整合到一个大表中
nutrients = []
for rec in db:
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)

In [308]:
nutrients

,description,group,units,value,id
0,Protein,Composition,g,25.180,1008
1,Total lipid (fat),Composition,g,29.200,1008
2,"Carbohydrate, by difference",Composition,g,3.060,1008
3,Ash,Other,g,3.280,1008
4,Energy,Energy,kcal,376.000,1008
5,Water,Composition,g,39.280,1008
6,Energy,Energy,kJ,1573.000,1008
7,"Fiber, total dietary",Composition,g,0.000,1008
8,"Calcium, Ca",Elements,mg,673.000,1008
9,"Iron, Fe",Elements,mg,0.640,1008
10,"Magnesium, Mg",Elements,mg,22.000,1008
11,"Phosphorus, P",Elements,mg,490.000,1008
12,"Potassium, K",Elements,mg,93.000,1008
13,"Sodium, Na",Elements,mg,690.000,1008
14,"Zinc, Zn",Elements,mg,2.940,1008
15,"Copper, Cu",Elements,mg,0.024,1008
16,"Manganese, Mn",Elements,mg,0.021,1008
17,"Selenium, Se",Elements,mcg,14.500,1008
18,"Vitamin A, IU",Vitamins,IU,1054.000,1008
19,Retinol,Vitamins,mcg,262.000,1008
20,"Vitamin A, RAE",Vitamins,mcg_RAE,271.000,1008
21,"Vitamin C, total ascorbic acid",Vitamins,mg,0.000,1008
22,Thiamin,Vitamins,mg,0.031,1008
23,Riboflavin,Vitamins,mg,0.450,1008
24,Niacin,Vitamins,mg,0.180,1008
25,Pantothenic acid,Vitamins,mg,0.190,1008
26,Vitamin B-6,Vitamins,mg,0.074,1008
27,"Folate, total",Vitamins,mcg,18.000,1008
28,Vitamin B-12,Vitamins,mcg,0.270,1008
29,Folic acid,Vitamins,mcg,0.000,1008
...,...,...,...,...,...
389325,"Selenium, Se",Elements,mcg,1.100,43546
389326,"Vitamin A, IU",Vitamins,IU,5.000,43546
389327,Retinol,Vitamins,mcg,0.000,43546
389328,"Vitamin A, RAE",Vitamins,mcg_RAE,0.000,43546
389329,"Carotene, beta",Vitamins,mcg,2.000,43546
389330,"Carotene, alpha",Vitamins,mcg,2.000,43546
389331,Vitamin E (alpha-tocopherol),Vitamins,mg,0.250,43546
389332,Vitamin D,Vitamins,IU,0.000,43546
389333,Vitamin D (D2 + D3),Vitamins,mcg,0.000,43546
389334,"Cryptoxanthin, beta",Vitamins,mcg,0.000,43546
389335,Lycopene,Vitamins,mcg,0.000,43546
389336,Lutein + zeaxanthin,Vitamins,mcg,20.000,43546
389337,"Vitamin C, total ascorbic acid",Vitamins,mg,21.900,43546
389338,Thiamin,Vitamins,mg,0.020,43546
389339,Riboflavin,Vitamins,mg,0.060,43546
389340,Niacin,Vitamins,mg,0.540,43546
389341,Vitamin B-6,Vitamins,mg,0.260,43546
389342,"Folate, total",Vitamins,mcg,17.000,43546
389343,Vitamin B-12,Vitamins,mcg,0.000,43546
389344,"Choline, total",Vitamins,mg,4.100,43546
389345,Vitamin K (phylloquinone),Vitamins,mcg,0.500,43546
389346,Folic acid,Vitamins,mcg,0.000,43546
389347,"Folate, food",Vitamins,mcg,17.000,43546
389348,"Folate, DFE",Vitamins,mcg_DFE,17.000,43546
389349,"Vitamin E, added",Vitamins,mg,0.000,43546
389350,"Vitamin B-12, added",Vitamins,mcg,0.000,43546
389351,Cholesterol,Other,mg,0.000,43546
389352,"Fatty acids, total saturated",Other,g,0.072,43546
389353,"Fatty acids, total monounsaturated",Other,g,0.028,43546
389354,"Fatty acids, total polyunsaturated",Other,g,0.041,43546

In [310]:
# 丢弃重复项
nutrients.duplicated().sum()
nutrients = pd.concat(nutrients, ignore_index=True)

AttributeError: 'list' object has no attribute 'duplicated'

In [311]:
nutrients = nutrients.drop_duplicates()

AttributeError: 'list' object has no attribute 'drop_duplicates'

In [312]:
# 由于两个df中都有“group”和“description”，为了区分，对其重命名：
col_mapping = {'description':'food',
              'group':'fgroup'}

In [313]:
info = info.rename(columns=col_mapping, copy=False)

In [314]:
info

,food,fgroup,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,
5,"Cheese, mozzarella, part skim milk, low moisture",Dairy and Egg Products,1029,
6,"Cheese, romano",Dairy and Egg Products,1038,
7,"Cheese, roquefort",Dairy and Egg Products,1039,
8,"Cheese spread, pasteurized process, american, ...",Dairy and Egg Products,1048,
9,"Cream, fluid, half and half",Dairy and Egg Products,1049,
10,"Sour dressing, non-butterfat, cultured, filled...",Dairy and Egg Products,1058,
11,"Milk, filled, fluid, with blend of hydrogenate...",Dairy and Egg Products,1059,
12,"Cream substitute, liquid, with lauric acid oil...",Dairy and Egg Products,1068,
13,"Cream substitute, powdered",Dairy and Egg Products,1069,
14,"Milk, producer, fluid, 3.7% milkfat",Dairy and Egg Products,1078,
15,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1079,None
16,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1080,
17,"Milk, reduced fat, fluid, 2% milkfat, protein ...",Dairy and Egg Products,1081,
18,"Milk, lowfat, fluid, 1% milkfat, with added vi...",Dairy and Egg Products,1082,
19,"Milk, lowfat, fluid, 1% milkfat, with added no...",Dairy and Egg Products,1083,
20,"Milk, lowfat, fluid, 1% milkfat, protein forti...",Dairy and Egg Products,1084,
21,"Milk, nonfat, fluid, with added vitamin A and ...",Dairy and Egg Products,1085,
22,"Milk, nonfat, fluid, with added nonfat milk so...",Dairy and Egg Products,1086,
23,"Milk, nonfat, fluid, protein fortified, with a...",Dairy and Egg Products,1087,
24,"Milk, buttermilk, fluid, cultured, lowfat",Dairy and Egg Products,1088,
25,"Milk, low sodium, fluid",Dairy and Egg Products,1089,
26,"Milk, dry, whole, with added vitamin D",Dairy and Egg Products,1090,
27,"Milk, dry, nonfat, regular, without added vita...",Dairy and Egg Products,1091,
28,"Milk, dry, nonfat, instant, with added vitamin...",Dairy and Egg Products,1092,
29,"Milk, dry, nonfat, calcium reduced",Dairy and Egg Products,1093,
...,...,...,...,...
6606,"Beef, tenderloin, steak, separable lean only, ...",Beef Products,23628,
6607,"Beef, top sirloin, steak, separable lean only,...",Beef Products,23629,
6608,"Beef, short loin, top loin, steak, separable l...",Beef Products,23630,
6609,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23631,
6610,"Beef, brisket, flat half, separable lean only,...",Beef Products,23632,
6611,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23633,
6612,"Beef, brisket, flat half, separable lean only,...",Beef Products,23634,
6613,"Beef, round, eye of round, roast, separable le...",Beef Products,23635,
6614,"Beef, round, top round, steak, separable lean ...",Beef Products,23636,
6615,"Beef, round, bottom round, roast, separable le...",Beef Products,23637,
6616,"Beef, rib, small end (ribs 10-12), separable l...",Beef Products,23638,
6617,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27015,Campbell Soup Co.
6618,"CAMPBELL Soup Company, CAMPBELL's Red and Whit...","Soups, Sauces, and Gravies",27016,Campbell Soup Co.
6619,"CAMPBELL Soup Company, CAMPBELL'S SELECT Soups...","Soups, Sauces, and Gravies",27021,Campbell Soup Co.
6620,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27022,Campbell Soup Co.
6621,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27023,Campbell Soup Co.
6622,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27024,Campbell Soup Co.
6623,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27025,Campbell Soup Co.
6624,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27026,Campbell Soup Co.
6625,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27032,Campbell Soup Co.
6626,"CAMPBELL Soup Company, V8 Vegetable Juice, Ess...",Vegetables and Vegetable Products,31010,Campbell Soup Co.
6627,"CAMPBELL Soup Company, V8 Vegetable Juice, Spi...",Vegetables and Vegetable Products,31013,Campbell Soup Co.
6628,"CAMPBELL Soup Company, PACE, Jalapenos Nacho S...",Vegetables and Vegetable Products,31014,Campbell Soup Co.
6629,"CAMPBELL Soup Company, V8 60% Vegetable Juice,...",Vegetables and Vegetable Products,31016,Campbell Soup Co.
6630,"CAMPBELL Soup Company, V8 Vegetable Juice, Low...",Vegetables and Vegetable Products,31017,Campbell Soup Co.
6631,"Bologna, beef, low fat",Sausages and Luncheon Meats,42161,
6632,"Turkey and pork sausage, fresh, bulk, patty or...",Sausages and Luncheon Meats,42173,
6633,"Babyfood, juice, pear",Baby Foods,43408,None
6634,"Babyfood, dessert, banana yogurt, strained",Baby Foods,43539,None
6635,"Babyfood, banana no tapioca, strained",Baby Foods,43546,None

In [315]:
# 合并info和nutrients
ndata = pd.merge(nutrients, info, on='id', how='outer')

TypeError: Can only merge Series or DataFrame objects, a <class 'list'> was passed

In [316]:
ndata

NameError: name 'ndata' is not defined